In [78]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn import linear_model
%matplotlib inline

In [98]:
df = pd.read_csv("hiring.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [80]:
# we can see the null values in 2 coloums let's fix them one by one
#starting with test_score

In [101]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(int(df['test_score(out of 10)'].mean()))

In [102]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    7.0                           7      72000
7     eleven                    7.0                           8      80000

In [50]:
# now null is removed from 2nd column coming to the first one now
# data is in word format we need to convert it.
# and null values will trouble here as NaN is not defined in w2n

In [103]:
from word2number import w2n
df['experience'] = df['experience'].fillna('zero')
for i in range(len(df['experience'])):
    df['experience'][i] = w2n.word_to_num(df['experience'][i])
df

C:\Users\Dell\AppData\Local\Temp\ipykernel_6684\1198085645.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['experience'][i] = w2n.word_to_num(df['experience'][i])

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0                    8.0                           9      50000
1          0                    8.0                           6      45000
2          5                    6.0                           7      60000
3          2                   10.0                          10      65000
4          7                    9.0                           6      70000
5          3                    7.0                          10      62000
6         10                    7.0                           7      72000
7         11                    7.0                           8      80000

In [ ]:
# Now data is set, and we are ready to work on it.

In [105]:
rig = linear_model.LinearRegression()
rig.fit(df[['experience','test_score(out of 10)','interview_score(out of 10)']],df['salary($)'])

LinearRegression()

In [106]:
rig.coef_

array([2922.26901502, 2221.30909959, 2147.48256637])

In [107]:
rig.intercept_

14992.65144669314

In [67]:
#Everything is ready and we are ready to predict now.

In [108]:
data = pd.read_csv('prediction.csv')
data

   experience  test_score(out of 10)  interview_score(out of 10)
0           2                      9                           6
1          12                     10                          10

In [109]:
data['salary($)'] = rig.predict(data[['experience','test_score(out of 10)','interview_score(out of 10)']])
data

   experience  test_score(out of 10)  interview_score(out of 10)     salary($)
0           2                      9                           6  53713.866771
1          12                     10                          10  93747.796287

In [110]:
data.to_csv('prediction.csv',index=False)

In [112]:
predicted_data = pd.read_csv("prediction.csv")
predicted_data

   experience  test_score(out of 10)  interview_score(out of 10)     salary($)
0           2                      9                           6  53713.866771
1          12                     10                          10  93747.796287